## Homework

In [1]:
import pandas as pd
from sqlalchemy import create_engine

from time import time

In [2]:
df_iter = pd.read_csv('green_tripdata_2019-01.csv', iterator=True, chunksize=100000)

In [4]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [ ]:
print(pd.io.sql.get_schema(df, name='green_taxi_data', con=engine))

CREATE TABLE green_taxi_data (
	"VendorID" BIGINT,
	lpep_pickup_datetime TEXT,
	lpep_dropoff_datetime TEXT,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

In [5]:
while True: 

    try:
        start = time()

        df = next(df_iter)

        df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
        df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
        
        df.to_sql(name='yellow_taxi_data', con=engine, if_exists='append')

        end = time()

        print('Inserted a chunk, it took %.3f second' % (end - start))
    except StopIteration:
        print("We are done...")
        break

Inserted a chunk, it took 16.935 second
Inserted a chunk, it took 16.213 second
Inserted a chunk, it took 16.062 second
Inserted a chunk, it took 15.978 second
Inserted a chunk, it took 16.038 second
Inserted a chunk, it took 16.553 second
Inserted a chunk, it took 5.358 second
We are done...

In [11]:
df = pd.read_csv('green_tripdata_2019-01.csv', nrows=100)
df.tail()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
95,2,2019-01-01 00:15:42,2019-01-01 00:41:04,N,1,97,179,1,7.83,26.0,0.5,0.5,5.46,0.0,NaN,0.3,32.76,1,1,NaN
96,2,2019-01-01 00:21:28,2019-01-01 00:48:15,N,1,7,230,1,4.49,20.0,0.5,0.5,4.00,0.0,NaN,0.3,25.30,1,1,NaN
97,2,2019-01-01 00:17:10,2019-01-01 00:23:34,N,1,42,42,1,1.08,6.5,0.5,0.5,0.00,0.0,NaN,0.3,7.80,2,1,NaN
98,2,2019-01-01 00:25:01,2019-01-01 00:43:55,N,1,42,232,2,8.74,25.0,0.5,0.5,0.00,0.0,NaN,0.3,26.30,2,1,NaN
99,2,2019-01-01 00:36:56,2019-01-01 00:43:50,N,1,223,7,5,1.32,7.0,0.5,0.5,2.00,0.0,NaN,0.3,10.30,1,1,NaN

In [6]:
df_zones = pd.read_csv('taxi+_zone_lookup.csv')

df_zones.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [7]:
df_zones.to_sql(name='zones', con=engine, if_exists='replace')

265

In [13]:
# How many taxi trips were totally made on January 15?

query = """
        SELECT COUNT(*)
        FROM yellow_taxi_data
        WHERE DATE(lpep_pickup_datetime) = '2019-01-15';
"""

pd.read_sql_query(query, con=engine)

   count
0  20689

In [15]:
# Which was the day with the largest trip distance?

query = """
        SELECT DATE(lpep_pickup_datetime), "trip_distance"
        FROM yellow_taxi_data
        WHERE "trip_distance" = (
                SELECT MAX(trip_distance)
                FROM yellow_taxi_data);
"""

pd.read_sql_query(query, con=engine)

         date  trip_distance
0  2019-01-15         117.99

In [17]:
# In 2019-01-01 how many trips had 2 and 3 passengers?

query = """
        SELECT COUNT(*)
        FROM yellow_taxi_data
        WHERE DATE(lpep_pickup_datetime) = '2019-01-01' AND "passenger_count" = 2;
"""

query2 = """
        SELECT COUNT(*)
        FROM yellow_taxi_data
        WHERE DATE(lpep_pickup_datetime) = '2019-01-01' AND "passenger_count" = 3;
"""

print(pd.read_sql_query(query, con=engine))
print(pd.read_sql_query(query2, con=engine))

   count
0   1282
   count
0    254

In [22]:
# For the passengers picked up in the Astoria Zone which was the drop up zone that had the largest tip?

query = """
        SELECT "Zone"
        FROM zones
        WHERE "LocationID" = (
                SELECT "DOLocationID"
                FROM yellow_taxi_data
                WHERE tip_amount = (
                        SELECT MAX(tip_amount)
                        FROM yellow_taxi_data
                        WHERE "PULocationID" = (
                                SELECT "LocationID"
                                FROM zones
                                WHERE "Zone" = 'Astoria')));
"""

pd.read_sql_query(query, con=engine)

                            Zone
0  Long Island City/Queens Plaza